// var acd_sys = ['博士班', '多元專長', '日二技', '日二技', '日二技', '日二技', '日二技', '日二技', '日二技', '日二技', '日二技', 
//                '日二技', '日二技', '日五專', '日五專', '日五專', '日五專', '日五專', '日五專', '日五專', '日四技', '日四技', '日四技', '日四技', 
//                '日四技', '日四技', '日四技', '日四技', '日四技', '日四技', '碩士在職專班', '碩士在職專班', '碩士班', '碩士班', '碩士班', '碩士班', 
//                '碩士班', '碩士班', '碩士班', '碩士班', '碩士班', '碩士班', '進二專', '進二專', '進二技', '進二技', '進二技', '進二技', '進二技', 
//                '進二技', '進四技', '進四技', '進四技', '進四技', '進四技', '進四技']
// var dept = ['財經學院博士班', '多元專長培力課程', '二技企管', '二技創科', '二技商務', '二技商設', '二技應外', '二技數媒', '二技會資', 
//             '二技菁英', '二技財稅', '二技財金', '二技資管', '五專企管', '五專國貿', '五專應外', '五專會計與資料科學科', '五專財稅', 
//             '五專財金', '五專資管', '四技企管', '四技創科', '四技商務', '四技商設', '四技應外', '四技數媒', '四技會資', '四技財稅', 
//             '四技財金', '四技資管', '企業管理系EMBA在職專班', '境外碩士在職班(春季)', '企業管理系碩士班', '創研所', '國際商務系碩士班', 
//             '會計財稅碩士班', '會計資訊系碩士班', '財務金融系碩士班', '財政稅務系碩士班', '貿易實務法律暨談判碩士學位學程', '資研所', 
//             '資訊管理系人工智慧與商業應用碩士', '進二專企管', '進二專外語', '進二技企管', '進二技應外', '進二技會資', '進二技財稅', 
//             '進二技財金', '進二技資管', '進四技企管', '進四技商務', '進四技數媒', '進四技會資', '進四技財金', '進四技資管']
// var cnt = [2, 2, 63, 57, 65, 85, 56, 2, 63, 8, 63, 72, 63, 100, 92, 88, 102, 75, 96, 67, 223, 78, 203, 95, 
//            72, 100, 189, 162, 89, 65, 41, 1, 27, 29, 29, 9, 18, 26, 15, 13, 17, 8, 223, 36, 216, 149, 87, 
//            86, 93, 137, 72, 58, 56, 58, 56, 107]

// var data = [{
//     type: "sunburst",
//     labels: ["Eve", "Cain", "Seth", "Enos", "Noam", "Abel", "Awan", "Enoch", "Azura"],
//     parents: ["", "Eve", "Eve", "Seth", "Seth", "Eve", "Eve", "Awan", "Eve" ],
//     values:  [10, 14, 12, 10, 2, 6, 6, 4, 4],
//     outsidetextfont: {size: 20, color: "#377eb8"},
//     leaf: {opacity: 0.4},
//     marker: {line: {width: 2}},

    // type: "sunburst",
    // labels: ['博士班', '多元專長', '日二技', '日二技', '日二技', '日二技', '日二技', '日二技', '日二技', '日二技', '日二技', 
    // '日二技', '日二技', '日五專', '日五專', '日五專', '日五專', '日五專', '日五專', '日五專', '日四技', '日四技', '日四技', '日四技', 
    // '日四技', '日四技', '日四技', '日四技', '日四技', '日四技', '碩士在職專班', '碩士在職專班', '碩士班', '碩士班', '碩士班', '碩士班', 
    // '碩士班', '碩士班', '碩士班', '碩士班', '碩士班', '碩士班', '進二專', '進二專', '進二技', '進二技', '進二技', '進二技', '進二技', 
    // '進二技', '進四技', '進四技', '進四技', '進四技', '進四技', '進四技'],
    // parents: ['財經學院博士班', '多元專長培力課程', '二技企管', '二技創科', '二技商務', '二技商設', '二技應外', '二技數媒', '二技會資', 
    // '二技菁英', '二技財稅', '二技財金', '二技資管', '五專企管', '五專國貿', '五專應外', '五專會計與資料科學科', '五專財稅', 
    // '五專財金', '五專資管', '四技企管', '四技創科', '四技商務', '四技商設', '四技應外', '四技數媒', '四技會資', '四技財稅', 
    // '四技財金', '四技資管', '企業管理系EMBA在職專班', '境外碩士在職班(春季)', '企業管理系碩士班', '創研所', '國際商務系碩士班', 
    // '會計財稅碩士班', '會計資訊系碩士班', '財務金融系碩士班', '財政稅務系碩士班', '貿易實務法律暨談判碩士學位學程', '資研所', 
    // '資訊管理系人工智慧與商業應用碩士', '進二專企管', '進二專外語', '進二技企管', '進二技應外', '進二技會資', '進二技財稅', 
    // '進二技財金', '進二技資管', '進四技企管', '進四技商務', '進四技數媒', '進四技會資', '進四技財金', '進四技資管'],
    // values:  [2, 2, 63, 57, 65, 85, 56, 2, 63, 8, 63, 72, 63, 100, 92, 88, 102, 75, 96, 67, 223, 78, 203, 95, 
    //     72, 100, 189, 162, 89, 65, 41, 1, 27, 29, 29, 9, 18, 26, 15, 13, 17, 8, 223, 36, 216, 149, 87, 
    //     86, 93, 137, 72, 58, 56, 58, 56, 107],
// }];
  
// var layout = {
//     margin: {l: 0, r: 0, b: 0, t: 0},
//     width: 500,
//     height: 400
// };
  
  
// Plotly.newPlot('snbrts', data, layout);

d3.csv('https://raw.githubusercontent.com/plotly/datasets/master/coffee-flavors.csv', function(err, rows){
        function unpack(rows, key) {
        return rows.map(function(row) {return row[key]})
      }
      
        var data = [{
              type: "sunburst",
              maxdepth: 2,
              ids: unpack(rows, 'ids'),
              labels: unpack(rows, 'labels'),
              parents: unpack(rows, 'parents'),
              textposition: 'inside',
              insidetextorientation: 'radial'
        }]
      
        var layout = {margin: {l: 0, r: 0, b: 0, t:0},
                      width: 500,
                      height: 400
    }
      
        Plotly.newPlot('snbrts', data, layout)
      })